{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_filter": 24, "nb_col": 5, "name": "convolution2d_1", "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "W_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "activation": "relu", "b_constraint": null, "trainable": true, "input_dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_filter": 36, "nb_col": 5, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_2", "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_row": 5, "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_filter": 48, "nb_col": 5, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_3", "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_row": 5, "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_4", "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_row": 3, "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "trainable": true, "name": "convolution2d_5", "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_row": 3, "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 1024, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "relu", "name": "dense_1", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "relu", "name": "dense_2", "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 50, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "relu", "name": "dense_3", "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "relu", "name": "dense_4", "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "init": "normal", "activity_regularizer": null, "bias": true, "input_dim": null, "activation": "linear", "name": "dense_5", "b_regularizer": null}}]}